; domain
;Header and description

(define (domain simple_robot_move_domain)

(:requirements :strips :typing :negative-preconditions)

(:types
    static_object - object
    location - object
    robot - object
    possible_move - object
)

(:predicates 
    (at ?r - robot ?l - location)
    (possible_move ?from - location ?to - location)
    (visited ?l - location)

)
(:action move
    :parameters (?r - robot 
        ?start_loc - location ?end_loc - location)
    :precondition (
        and(at ?r ?start_loc)
        (not(visited ?end_loc))
    )

    :effect (
        and(at ?r ?end_loc)
        (not(at ?r ?start_loc))
        (visited ?end_loc)
        )
)
)

; problem
(define (problem task)
(:domain simple_robot_move_domain)
(:objects
    kitchen bathroom livingroom ricocharger - location
    rico - robot
)
(:init
    (at rico ricocharger)



)
(:goal (and
    (visited kitchen)
    (visited bathroom)
    (visited livingroom)
    (visited ricocharger)
))
)

; plan
1. (move rico ricocharger bathroom)
   deleted: (at rico ricocharger)
   added: (at rico bathroom) (visited bathroom)
   goals met: 1 of 4
2. (move rico bathroom kitchen)
   deleted: (at rico bathroom)
   added: (at rico kitchen) (visited kitchen)
   goals met: 2 of 4
3. (move rico kitchen livingroom)
   deleted: (at rico kitchen)
   added: (at rico livingroom) (visited livingroom)
   goals met: 3 of 4
4. (move rico livingroom ricocharger)
   deleted: (at rico livingroom)
   added: (at rico ricocharger) (visited ricocharger)
   goals met: 4 of 4
